In [ ]:
# pip install pandas

In [67]:
import pandas as pd

In [68]:
df=pd.read_csv("C:\\Users\\Neha\\Downloads\\sales_customer_analytics.csv")

In [69]:
df.head(10) #head() is used to view the first five rows along with each and every column in the dataset

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating
0,1001,2024-01-01,252,Pooja,Delhi,Laptop,Electronics,1,5852,0.10,UPI,Returned,5.0
1,1002,2024-01-01,293,Siddharth,Mumbai,Mobile,Electronics,1,27922,0.05,Cash,Delivered,5.0
2,1003,2024-01-01,215,Megha,Hyderabad,Mobile,Electronics,3,42376,0.15,Debit Card,Cancelled,5.0
3,1004,2024-01-01,272,Ananya,Hyderabad,Monitor,Electronics,1,61492,0.20,UPI,Delivered,3.0
4,1005,2024-01-02,261,Rohit,Chennai,Tablet,Electronics,1,18306,0.15,Cash,Cancelled,4.0
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.0
6,1007,2024-01-02,283,Riya,Bangalore,Desk,Furniture,2,54444,0.10,UPI,Cancelled,2.0
7,1008,2024-01-03,287,Kavya,Delhi,Desk,Furniture,3,59963,NaN,Credit Card,Delivered,5.0
8,1009,2024-01-03,275,Riya,Hyderabad,Keyboard,Accessories,1,57218,0.15,Debit Card,Delivered,3.0
9,1010,2024-01-03,275,Isha,Mumbai,Headphones,Accessories,1,25044,0.05,UPI,Delivered,NaN

In [70]:
df.tail(10) #tail() is used to view the last 5 rows (default) along with each and every column in the dataset

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating
540,1541,2024-06-27,280,Sneha,Chennai,Desk,Furniture,2,23353,0.20,Debit Card,Delivered,3.0
541,1542,2024-06-27,202,Rahul,Bangalore,Mobile,Electronics,4,40496,0.00,Debit Card,Delivered,5.0
542,1543,2024-06-27,292,Karan,Mumbai,Tablet,Electronics,1,52418,0.10,Cash,Delivered,3.0
543,1544,2024-06-28,232,Megha,Pune,Chair,Furniture,1,23708,0.00,Debit Card,Delivered,5.0
544,1545,2024-06-28,291,Aditya,Chennai,Mouse,Accessories,2,10143,NaN,Cash,Delivered,3.0
545,1546,2024-06-28,284,Neha,Delhi,Monitor,Electronics,1,48761,0.15,Credit Card,Delivered,4.0
546,1547,2024-06-29,224,Pooja,Delhi,Desk,Furniture,3,10572,0.05,Debit Card,Delivered,5.0
547,1548,2024-06-29,212,Megha,Mumbai,Desk,Furniture,4,54018,NaN,UPI,Delivered,5.0
548,1549,2024-06-29,250,Manish,Chennai,Headphones,Accessories,4,45441,0.10,Credit Card,Cancelled,5.0
549,1550,2024-06-30,235,Megha,Mumbai,Monitor,Electronics,1,28342,NaN,Cash,Delivered,3.0

In [71]:
df.info() # info() is used to check for information of the dataframe columns.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       550 non-null    int64
 1   OrderDate     550 non-null    object
 2   CustomerID    550 non-null    int64
 3   CustomerName  550 non-null    object
 4   City          550 non-null    object
 5   Product       550 non-null    object
 6   Category      550 non-null    object
 7   Quantity      550 non-null    int64
 8   UnitPrice     550 non-null    int64
 9   DiscountPct   458 non-null    float64
 10  PaymentMode   550 non-null    object
 11  OrderStatus   550 non-null    object
 12  Rating        512 non-null    float64
dtypes: float64(2), int64(4), object(7)
memory usage: 56.0+ KB

In [72]:
df.describe() # describe() returns the statistical summary only for numerical columns

,OrderID,CustomerID,Quantity,UnitPrice,DiscountPct,Rating
count,550.000000,550.000000,550.000000,550.000000,458.000000,512.000000
mean,1275.500000,250.258182,2.454545,33071.741818,0.099891,3.742188
std,158.915596,29.763651,1.108309,18322.527529,0.069894,1.139891
min,1001.000000,201.000000,1.000000,1007.000000,0.000000,1.000000
25%,1138.250000,224.000000,1.000000,17455.750000,0.050000,3.000000
50%,1275.500000,251.000000,2.000000,33185.000000,0.100000,4.000000
75%,1412.750000,275.000000,3.000000,49023.500000,0.150000,5.000000
max,1550.000000,300.000000,4.000000,64910.000000,0.200000,5.000000

-OrderId
-orderid feature have **550** values.
-orderid feature mean value **1275.500000** is greater than standard deviation value **158.915596** ,less data variated
-orderid feature **1001** is the minimum value and 1550 is the maximum value in this column.
-orderid 25% of data is below this **1138** 
-orderid 50% of data is below this **1275** 
-orderid 75% of data is below this **1412**

-OrderDate
-orderdate feature have **550** values
-orderdate feature have **182** unique values
-orderdate **01-01-2024** is the most frequent value in this column ,because it is repeated 4 times.

-CustomerId
-customerid have **550** values
-customerid  mean value **250.258182** is more than mean value **29.763651**so the data is less variated.
-customerid  **201** is the minimum value and **300** is the maximum value.
-customerid 25% of data is below this **224** 
-customerid 50% of data is below this **251** 
-customerid 75% of data is below this **271**

-CustomerName
-customername feature have **550** values
-ocustomername feature have **20** unique values
-customername feature **pooja** is the most frequent value in this column ,because it is repeated **37** times.

-City
-city feature have **550** values.
-city feature have **6** unique values
-city feature **chennai** is the most frequent value in this column ,because it is repeated **102** times.

-Product
-product feature have **550** values
-poduct feature have **9** unique values
-product feature **chair** is the most frequent value in this column ,because it is repeated **68** times.

-Category
-category feature have **550** values
-category feature have **3** unique values
-category feature **electronics** is the most frequent value in this column ,because it is repeated **243** times.

-Quantity
-quantity feature have **550** values
-quantity feature mean value **2.454545** is more than standard deviation value **1.108309** so the data is less variated.
-quantityid 25% of data is below this **1** 
-quantityid 50% of data is below this **2** 
-quantityid 75% of data is below this **3**

-UnitPrice
-unitprice feature have **550** values
-unitprice feature mean value **33071.741818** is more than standard deviation value **18322.527529** so the data is less variated.
-unitprice feature **1007** is the minimum value and maximum value **64910**
-unitprice 25% of data is below this **17455.750000**
-unitprice 50% of data is below this **33185**
-unitprice 75% of data is below this **49023.500000**

- DiscountPct
-discountpct feature have **550** values
-discountpct feature both the values standard deviation and mean are same or zero
-discountpct feature **0** is the minimum value and maximum value **0**  of this column.
-discountpct 25% of data is below this **0**
-discountpct 50% of data is below this **0**
-discountpct 75% of data is below this **0**

-PaymentMode
-paymentmode feature have **550** values
-paymentmode feature have **4** unique values
-paymentmode feature **upi** is the most frequent value in this column ,because it is repeated **156** times.

-OrderStatus
-orderstatus feature have **550** values
-orderstatus feature have **3** unique values.
-orderstatus feature **delivered** is the most frequent value in this column,because it is repeated **457** times.

-Rating
-rating feature have **550** values
-rating have mean **3** is greater than standard deviation **1** so the data is less varited.
-rating feature **1** is the minimum value  and maximum value **5**of this column.
-rating 25% of data lies below this **3**
-rating 50% of data lies below this **4**
-rating 75% of data lies below this **5**

-TotalSale
-totalsale feature have **550** values
-totalsale feature have mean **81438.976364** is greater than standard deviation **63585.253514** so the data is less varited.
-totalsale feature **1136** is the minimum value and maximum value **259640** of this column.
-totalsale 25% of data lies below this **32630**
-totalsale 50% of data lies below this  **61669** 
-totalsale 75% of data lies below this **115376.750000**

-ExactSalesAmount
-exactsalesamount feature have **550** values
-exactsalesamount feature have mean **74457** is greater than standard deviation **58421** so the data is less varited.
-exactsalesamount **1136** is the minimum value and maximum value **244372** of this column.
-exactsalesamount 25% of data lies below this **29283.487500** 
-exactsalesamount  50% of data lies below this **54992.200000** 
-exactsalesamount 75% of data lies below this **106387**

In [76]:
df.describe(include="all") # describe(include="all") return the statistical summary for all the columns.

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating
count,550.000000,550,550.000000,550,550,550,550,550.000000,550.000000,458.000000,550,550,512.000000
unique,NaN,182,NaN,20,6,9,3,NaN,NaN,NaN,4,3,NaN
top,NaN,2024-01-01,NaN,Pooja,Chennai,Chair,Electronics,NaN,NaN,NaN,UPI,Delivered,NaN
freq,NaN,4,NaN,37,102,68,243,NaN,NaN,NaN,156,457,NaN
mean,1275.500000,NaN,250.258182,NaN,NaN,NaN,NaN,2.454545,33071.741818,0.099891,NaN,NaN,3.742188
std,158.915596,NaN,29.763651,NaN,NaN,NaN,NaN,1.108309,18322.527529,0.069894,NaN,NaN,1.139891
min,1001.000000,NaN,201.000000,NaN,NaN,NaN,NaN,1.000000,1007.000000,0.000000,NaN,NaN,1.000000
25%,1138.250000,NaN,224.000000,NaN,NaN,NaN,NaN,1.000000,17455.750000,0.050000,NaN,NaN,3.000000
50%,1275.500000,NaN,251.000000,NaN,NaN,NaN,NaN,2.000000,33185.000000,0.100000,NaN,NaN,4.000000
75%,1412.750000,NaN,275.000000,NaN,NaN,NaN,NaN,3.000000,49023.500000,0.150000,NaN,NaN,5.000000
max,1550.000000,NaN,300.000000,NaN,NaN,NaN,NaN,4.000000,64910.000000,0.200000,NaN,NaN,5.000000

In [77]:
df.isna().sum() # isna().sum() is used to get the total count of missing values in each and every column

OrderID          0
OrderDate        0
CustomerID       0
CustomerName     0
City             0
Product          0
Category         0
Quantity         0
UnitPrice        0
DiscountPct     92
PaymentMode      0
OrderStatus      0
Rating          38
dtype: int64

In [78]:
df.duplicated().sum() # duplicated().sum() is used to get the count of duplicate rows

np.int64(0)

In [79]:
df["DiscountPct"]= df["DiscountPct"].fillna(0)

In [80]:
df["Rating"].fillna(df["Rating"].mean(),inplace=True)

C:\Users\Neha\AppData\Local\Temp\ipykernel_7872\322049203.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Rating"].fillna(df["Rating"].mean(),inplace=True)

In [81]:
df.isna().sum()

OrderID         0
OrderDate       0
CustomerID      0
CustomerName    0
City            0
Product         0
Category        0
Quantity        0
UnitPrice       0
DiscountPct     0
PaymentMode     0
OrderStatus     0
Rating          0
dtype: int64

In [82]:
df.dtypes

OrderID           int64
OrderDate        object
CustomerID        int64
CustomerName     object
City             object
Product          object
Category         object
Quantity          int64
UnitPrice         int64
DiscountPct     float64
PaymentMode      object
OrderStatus      object
Rating          float64
dtype: object

In [83]:
df['OrderDate']=pd.to_datetime(df['OrderDate'])

In [84]:
df.dtypes

OrderID                  int64
OrderDate       datetime64[ns]
CustomerID               int64
CustomerName            object
City                    object
Product                 object
Category                object
Quantity                 int64
UnitPrice                int64
DiscountPct            float64
PaymentMode             object
OrderStatus             object
Rating                 float64
dtype: object

In [85]:
df['TotalSale']=df["Quantity"]*df["UnitPrice"]

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       550 non-null    int64
 1   OrderDate     550 non-null    datetime64[ns]
 2   CustomerID    550 non-null    int64
 3   CustomerName  550 non-null    object
 4   City          550 non-null    object
 5   Product       550 non-null    object
 6   Category      550 non-null    object
 7   Quantity      550 non-null    int64
 8   UnitPrice     550 non-null    int64
 9   DiscountPct   550 non-null    float64
 10  PaymentMode   550 non-null    object
 11  OrderStatus   550 non-null    object
 12  Rating        550 non-null    float64
 13  TotalSale     550 non-null    int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(6)
memory usage: 60.3+ KB

In [87]:
df.head()

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale
0,1001,2024-01-01,252,Pooja,Delhi,Laptop,Electronics,1,5852,0.10,UPI,Returned,5.0,5852
1,1002,2024-01-01,293,Siddharth,Mumbai,Mobile,Electronics,1,27922,0.05,Cash,Delivered,5.0,27922
2,1003,2024-01-01,215,Megha,Hyderabad,Mobile,Electronics,3,42376,0.15,Debit Card,Cancelled,5.0,127128
3,1004,2024-01-01,272,Ananya,Hyderabad,Monitor,Electronics,1,61492,0.20,UPI,Delivered,3.0,61492
4,1005,2024-01-02,261,Rohit,Chennai,Tablet,Electronics,1,18306,0.15,Cash,Cancelled,4.0,18306

In [88]:
df['ExactSalesAmount']=df['TotalSale']*(1-df['DiscountPct'])

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OrderID           550 non-null    int64
 1   OrderDate         550 non-null    datetime64[ns]
 2   CustomerID        550 non-null    int64
 3   CustomerName      550 non-null    object
 4   City              550 non-null    object
 5   Product           550 non-null    object
 6   Category          550 non-null    object
 7   Quantity          550 non-null    int64
 8   UnitPrice         550 non-null    int64
 9   DiscountPct       550 non-null    float64
 10  PaymentMode       550 non-null    object
 11  OrderStatus       550 non-null    object
 12  Rating            550 non-null    float64
 13  TotalSale         550 non-null    int64
 14  ExactSalesAmount  550 non-null    float64
dtypes: datetime64[ns](1), float64(3), int64(5), object(6)
memory usage: 64.6+ KB

In [90]:
# fetching columns single
df["CustomerName"]

0          Pooja
1      Siddharth
2          Megha
3         Ananya
4          Rohit
         ...
545         Neha
546        Pooja
547        Megha
548       Manish
549        Megha
Name: CustomerName, Length: 550, dtype: object

In [91]:
#multiple columns
df[["CustomerName","City","Product","Category"]]

    CustomerName       City     Product     Category
0          Pooja      Delhi      Laptop  Electronics
1      Siddharth     Mumbai      Mobile  Electronics
2          Megha  Hyderabad      Mobile  Electronics
3         Ananya  Hyderabad     Monitor  Electronics
4          Rohit    Chennai      Tablet  Electronics
..           ...        ...         ...          ...
545         Neha      Delhi     Monitor  Electronics
546        Pooja      Delhi        Desk    Furniture
547        Megha     Mumbai        Desk    Furniture
548       Manish    Chennai  Headphones  Accessories
549        Megha     Mumbai     Monitor  Electronics

[550 rows x 4 columns]

In [92]:
# fetching rows based on indexes-same as python slicing
df[5:10]

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.000000,19332,19332.0
6,1007,2024-01-02,283,Riya,Bangalore,Desk,Furniture,2,54444,0.10,UPI,Cancelled,2.000000,108888,97999.2
7,1008,2024-01-03,287,Kavya,Delhi,Desk,Furniture,3,59963,0.00,Credit Card,Delivered,5.000000,179889,179889.0
8,1009,2024-01-03,275,Riya,Hyderabad,Keyboard,Accessories,1,57218,0.15,Debit Card,Delivered,3.000000,57218,48635.3
9,1010,2024-01-03,275,Isha,Mumbai,Headphones,Accessories,1,25044,0.05,UPI,Delivered,3.742188,25044,23791.8

In [93]:
# boolean filtering
df[df["City"]=="Pune"]

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.000000,19332,19332.0
10,1011,2024-01-04,288,Pooja,Pune,Mobile,Electronics,3,7531,0.00,UPI,Delivered,5.000000,22593,22593.0
12,1013,2024-01-04,224,Kavya,Pune,Tablet,Electronics,4,14607,0.20,Debit Card,Cancelled,4.000000,58428,46742.4
18,1019,2024-01-06,230,Aditya,Pune,Desk,Furniture,2,6990,0.00,UPI,Delivered,3.000000,13980,13980.0
21,1022,2024-01-07,264,Siddharth,Pune,Keyboard,Accessories,1,5635,0.10,UPI,Delivered,5.000000,5635,5071.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
526,1527,2024-06-22,269,Riya,Pune,Mobile,Electronics,3,19582,0.05,Credit Card,Delivered,5.000000,58746,55808.7
532,1533,2024-06-24,219,Manish,Pune,Keyboard,Accessories,3,64836,0.10,Debit Card,Delivered,3.742188,194508,175057.2
536,1537,2024-06-25,269,Aditya,Pune,Laptop,Electronics,1,30232,0.05,Credit Card,Delivered,4.000000,30232,28720.4
537,1538,2024-06-26,204,Rahul,Pune,Chair,Furniture,2,20942,0.00,Credit Card,Delivered,3.000000,41884,41884.0
543,1544,2024-06-28,232,Megha,Pune,Chair,Furniture,1,23708,0.00,Debit Card,Delivered,5.000000,23708,23708.0

In [94]:
df[df["OrderStatus"]=="Delivered"]

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
1,1002,2024-01-01,293,Siddharth,Mumbai,Mobile,Electronics,1,27922,0.05,Cash,Delivered,5.0,27922,26525.90
3,1004,2024-01-01,272,Ananya,Hyderabad,Monitor,Electronics,1,61492,0.20,UPI,Delivered,3.0,61492,49193.60
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.0,19332,19332.00
7,1008,2024-01-03,287,Kavya,Delhi,Desk,Furniture,3,59963,0.00,Credit Card,Delivered,5.0,179889,179889.00
8,1009,2024-01-03,275,Riya,Hyderabad,Keyboard,Accessories,1,57218,0.15,Debit Card,Delivered,3.0,57218,48635.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
544,1545,2024-06-28,291,Aditya,Chennai,Mouse,Accessories,2,10143,0.00,Cash,Delivered,3.0,20286,20286.00
545,1546,2024-06-28,284,Neha,Delhi,Monitor,Electronics,1,48761,0.15,Credit Card,Delivered,4.0,48761,41446.85
546,1547,2024-06-29,224,Pooja,Delhi,Desk,Furniture,3,10572,0.05,Debit Card,Delivered,5.0,31716,30130.20
547,1548,2024-06-29,212,Megha,Mumbai,Desk,Furniture,4,54018,0.00,UPI,Delivered,5.0,216072,216072.00
549,1550,2024-06-30,235,Megha,Mumbai,Monitor,Electronics,1,28342,0.00,Cash,Delivered,3.0,28342,28342.00

In [95]:
# Multiple Conditions
df[(df["City"]=="Pune") & (df["OrderStatus"]=="Delivered")]

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.000000,19332,19332.00
10,1011,2024-01-04,288,Pooja,Pune,Mobile,Electronics,3,7531,0.00,UPI,Delivered,5.000000,22593,22593.00
18,1019,2024-01-06,230,Aditya,Pune,Desk,Furniture,2,6990,0.00,UPI,Delivered,3.000000,13980,13980.00
21,1022,2024-01-07,264,Siddharth,Pune,Keyboard,Accessories,1,5635,0.10,UPI,Delivered,5.000000,5635,5071.50
22,1023,2024-01-08,260,Manish,Pune,Tablet,Electronics,1,46245,0.05,Credit Card,Delivered,4.000000,46245,43932.75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
526,1527,2024-06-22,269,Riya,Pune,Mobile,Electronics,3,19582,0.05,Credit Card,Delivered,5.000000,58746,55808.70
532,1533,2024-06-24,219,Manish,Pune,Keyboard,Accessories,3,64836,0.10,Debit Card,Delivered,3.742188,194508,175057.20
536,1537,2024-06-25,269,Aditya,Pune,Laptop,Electronics,1,30232,0.05,Credit Card,Delivered,4.000000,30232,28720.40
537,1538,2024-06-26,204,Rahul,Pune,Chair,Furniture,2,20942,0.00,Credit Card,Delivered,3.000000,41884,41884.00
543,1544,2024-06-28,232,Megha,Pune,Chair,Furniture,1,23708,0.00,Debit Card,Delivered,5.000000,23708,23708.00

In [96]:
# using isin we can check multiple filters
df[df["City"].isin(["Pune","Chennai"])]

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
4,1005,2024-01-02,261,Rohit,Chennai,Tablet,Electronics,1,18306,0.15,Cash,Cancelled,4.0,18306,15560.1
5,1006,2024-01-02,221,Siddharth,Pune,Laptop,Electronics,3,6444,0.00,Credit Card,Delivered,3.0,19332,19332.0
10,1011,2024-01-04,288,Pooja,Pune,Mobile,Electronics,3,7531,0.00,UPI,Delivered,5.0,22593,22593.0
12,1013,2024-01-04,224,Kavya,Pune,Tablet,Electronics,4,14607,0.20,Debit Card,Cancelled,4.0,58428,46742.4
13,1014,2024-01-05,203,Pooja,Chennai,Monitor,Electronics,4,36709,0.15,Debit Card,Delivered,2.0,146836,124810.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
539,1540,2024-06-26,224,Manish,Chennai,Laptop,Electronics,3,10260,0.10,Credit Card,Delivered,1.0,30780,27702.0
540,1541,2024-06-27,280,Sneha,Chennai,Desk,Furniture,2,23353,0.20,Debit Card,Delivered,3.0,46706,37364.8
543,1544,2024-06-28,232,Megha,Pune,Chair,Furniture,1,23708,0.00,Debit Card,Delivered,5.0,23708,23708.0
544,1545,2024-06-28,291,Aditya,Chennai,Mouse,Accessories,2,10143,0.00,Cash,Delivered,3.0,20286,20286.0
548,1549,2024-06-29,250,Manish,Chennai,Headphones,Accessories,4,45441,0.10,Credit Card,Cancelled,5.0,181764,163587.6

In [97]:
df[df["TotalSale"].between(5000,15000)] #use between for range filter

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
0,1001,2024-01-01,252,Pooja,Delhi,Laptop,Electronics,1,5852,0.10,UPI,Returned,5.000000,5852,5266.80
18,1019,2024-01-06,230,Aditya,Pune,Desk,Furniture,2,6990,0.00,UPI,Delivered,3.000000,13980,13980.00
21,1022,2024-01-07,264,Siddharth,Pune,Keyboard,Accessories,1,5635,0.10,UPI,Delivered,5.000000,5635,5071.50
58,1059,2024-01-20,202,Priya,Chennai,Monitor,Electronics,1,14860,0.05,Cash,Delivered,4.000000,14860,14117.00
94,1095,2024-01-31,240,Kunal,Delhi,Tablet,Electronics,1,12355,0.10,Cash,Cancelled,3.000000,12355,11119.50
102,1103,2024-02-03,260,Rohit,Chennai,Headphones,Accessories,1,12982,0.05,Debit Card,Delivered,4.000000,12982,12332.90
110,1111,2024-02-06,209,Rahul,Chennai,Monitor,Electronics,1,11616,0.00,Cash,Delivered,1.000000,11616,11616.00
145,1146,2024-02-17,203,Siddharth,Delhi,Mobile,Electronics,3,3841,0.05,UPI,Delivered,3.000000,11523,10946.85
161,1162,2024-02-23,296,Pooja,Pune,Desk,Furniture,1,7076,0.15,UPI,Delivered,4.000000,7076,6014.60
168,1169,2024-02-25,236,Priya,Mumbai,Monitor,Electronics,4,2769,0.05,UPI,Delivered,5.000000,11076,10522.20
188,1189,2024-03-02,292,Siddharth,Delhi,Monitor,Electronics,2,3840,0.05,Cash,Cancelled,3.000000,7680,7296.00
193,1194,2024-03-04,227,Aarav,Delhi,Keyboard,Accessories,1,8643,0.10,Credit Card,Delivered,4.000000,8643,7778.70
194,1195,2024-03-04,262,Manish,Bangalore,Monitor,Electronics,1,7504,0.15,Debit Card,Delivered,2.000000,7504,6378.40
197,1198,2024-03-05,270,Manish,Hyderabad,Monitor,Electronics,4,1461,0.15,UPI,Delivered,2.000000,5844,4967.40
202,1203,2024-03-07,237,Vikram,Hyderabad,Monitor,Electronics,1,6582,0.05,Credit Card,Cancelled,3.000000,6582,6252.90
213,1214,2024-03-11,262,Arjun,Bangalore,Tablet,Electronics,1,6248,0.15,UPI,Delivered,3.000000,6248,5310.80
229,1230,2024-03-16,297,Megha,Mumbai,Desk,Furniture,1,13304,0.05,UPI,Delivered,4.000000,13304,12638.80
232,1233,2024-03-17,202,Arjun,Chennai,Mouse,Accessories,4,3261,0.15,UPI,Delivered,2.000000,13044,11087.40
251,1252,2024-03-23,216,Ananya,Mumbai,Desk,Furniture,2,4271,0.20,Debit Card,Delivered,3.000000,8542,6833.60
252,1253,2024-03-24,297,Siddharth,Delhi,Laptop,Electronics,2,7197,0.00,UPI,Delivered,3.000000,14394,14394.00
256,1257,2024-03-25,280,Pooja,Mumbai,Desk,Furniture,3,2419,0.00,Credit Card,Delivered,3.742188,7257,7257.00
260,1261,2024-03-26,259,Pooja,Chennai,Chair,Furniture,3,1971,0.20,UPI,Delivered,2.000000,5913,4730.40
324,1325,2024-04-16,241,Neha,Hyderabad,Mouse,Accessories,1,6298,0.10,Debit Card,Delivered,4.000000,6298,5668.20
338,1339,2024-04-21,248,Rahul,Hyderabad,Monitor,Electronics,1,10564,0.00,Cash,Delivered,2.000000,10564,10564.00
343,1344,2024-04-23,230,Rohit,Hyderabad,Mobile,Electronics,3,3751,0.00,Debit Card,Delivered,3.000000,11253,11253.00
350,1351,2024-04-25,298,Neha,Bangalore,Desk,Furniture,1,6538,0.10,Cash,Delivered,4.000000,6538,5884.20
427,1428,2024-05-20,214,Vikram,Mumbai,Tablet,Electronics,4,1659,0.00,Credit Card,Delivered,4.000000,6636,6636.00
439,1440,2024-05-24,225,Kavya,Pune,Chair,Furniture,2,4406,0.00,UPI,Delivered,4.000000,8812,8812.00
455,1456,2024-05-30,208,Priya,Mumbai,Tablet,Electronics,3,4564,0.00,Debit Card,Delivered,4.000000,13692,13692.00
457,1458,2024-05-30,260,Rahul,Hyderabad,Monitor,Electronics,1,12112,0.20,Credit Card,Delivered,4.000000,12112,9689.60
460,1461,2024-05-31,206,Aditya,Pune,Desk,Furniture,4,1470,0.15,Cash,Delivered,2.000000,5880,4998.00
486,1487,2024-06-09,201,Kavya,Chennai,Chair,Furniture,2,5821,0.00,Credit Card,Delivered,4.000000,11642,11642.00
497,1498,2024-06-12,222,Priya,Pune,Mouse,Accessories,1,6008,0.05,Debit Card,Delivered,5.000000,6008,5707.60
499,1500,2024-06-13,267,Pooja,Chennai,Mobile,Electronics,1,14831,0.00,Debit Card,Delivered,4.000000,14831,14831.00
508,1509,2024-06-16,292,Priya,Delhi,Chair,Furniture,2,6650,0.20,Credit Card,Delivered,3.742188,13300,10640.00

In [98]:
df.sort_values("TotalSale")# sorting values default is ascending

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
507,1508,2024-06-16,278,Aarav,Hyderabad,Monitor,Electronics,1,1136,0.00,UPI,Delivered,3.000000,1136,1136.00
330,1331,2024-04-18,221,Pooja,Bangalore,Mouse,Accessories,1,1682,0.10,Cash,Cancelled,4.000000,1682,1513.80
107,1108,2024-02-05,265,Rahul,Hyderabad,Tablet,Electronics,2,1345,0.00,Credit Card,Cancelled,1.000000,2690,2690.00
294,1295,2024-04-06,237,Riya,Delhi,Laptop,Electronics,1,2844,0.00,UPI,Delivered,3.742188,2844,2844.00
198,1199,2024-03-06,272,Nikita,Bangalore,Desk,Furniture,3,1007,0.05,UPI,Delivered,2.000000,3021,2869.95
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
464,1465,2024-06-01,299,Rahul,Delhi,Mouse,Accessories,4,61735,0.10,Credit Card,Delivered,3.000000,246940,222246.00
420,1421,2024-05-18,257,Neha,Chennai,Mouse,Accessories,4,62642,0.15,UPI,Delivered,2.000000,250568,212982.80
40,1041,2024-01-14,262,Aditya,Chennai,Laptop,Electronics,4,62864,0.10,Credit Card,Delivered,3.000000,251456,226310.40
250,1251,2024-03-23,211,Aditya,Chennai,Monitor,Electronics,4,63310,0.10,Cash,Delivered,5.000000,253240,227916.00
366,1367,2024-04-30,244,Kunal,Pune,Headphones,Accessories,4,64910,0.10,Debit Card,Delivered,1.000000,259640,233676.00

In [99]:
df.sort_values("TotalSale",ascending=False)

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
366,1367,2024-04-30,244,Kunal,Pune,Headphones,Accessories,4,64910,0.10,Debit Card,Delivered,1.000000,259640,233676.00
250,1251,2024-03-23,211,Aditya,Chennai,Monitor,Electronics,4,63310,0.10,Cash,Delivered,5.000000,253240,227916.00
40,1041,2024-01-14,262,Aditya,Chennai,Laptop,Electronics,4,62864,0.10,Credit Card,Delivered,3.000000,251456,226310.40
420,1421,2024-05-18,257,Neha,Chennai,Mouse,Accessories,4,62642,0.15,UPI,Delivered,2.000000,250568,212982.80
464,1465,2024-06-01,299,Rahul,Delhi,Mouse,Accessories,4,61735,0.10,Credit Card,Delivered,3.000000,246940,222246.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,1199,2024-03-06,272,Nikita,Bangalore,Desk,Furniture,3,1007,0.05,UPI,Delivered,2.000000,3021,2869.95
294,1295,2024-04-06,237,Riya,Delhi,Laptop,Electronics,1,2844,0.00,UPI,Delivered,3.742188,2844,2844.00
107,1108,2024-02-05,265,Rahul,Hyderabad,Tablet,Electronics,2,1345,0.00,Credit Card,Cancelled,1.000000,2690,2690.00
330,1331,2024-04-18,221,Pooja,Bangalore,Mouse,Accessories,1,1682,0.10,Cash,Cancelled,4.000000,1682,1513.80
507,1508,2024-06-16,278,Aarav,Hyderabad,Monitor,Electronics,1,1136,0.00,UPI,Delivered,3.000000,1136,1136.00

In [100]:
df.sort_values(["City","TotalSale"],ascending=[True,False])

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount
201,1202,2024-03-07,262,Sneha,Bangalore,Headphones,Accessories,4,55232,0.20,Credit Card,Delivered,5.0,220928,176742.4
184,1185,2024-03-01,284,Aarav,Bangalore,Chair,Furniture,4,55155,0.15,Cash,Delivered,2.0,220620,187527.0
405,1406,2024-05-13,233,Aditya,Bangalore,Headphones,Accessories,4,54112,0.00,Cash,Delivered,4.0,216448,216448.0
528,1529,2024-06-23,234,Isha,Bangalore,Laptop,Electronics,4,52293,0.20,Debit Card,Delivered,4.0,209172,167337.6
153,1154,2024-02-20,215,Kavya,Bangalore,Chair,Furniture,4,48708,0.15,Cash,Delivered,5.0,194832,165607.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
497,1498,2024-06-12,222,Priya,Pune,Mouse,Accessories,1,6008,0.05,Debit Card,Delivered,5.0,6008,5707.6
460,1461,2024-05-31,206,Aditya,Pune,Desk,Furniture,4,1470,0.15,Cash,Delivered,2.0,5880,4998.0
21,1022,2024-01-07,264,Siddharth,Pune,Keyboard,Accessories,1,5635,0.10,UPI,Delivered,5.0,5635,5071.5
413,1414,2024-05-16,299,Megha,Pune,Keyboard,Accessories,2,1687,0.10,Debit Card,Delivered,4.0,3374,3036.6
356,1357,2024-04-27,297,Neha,Pune,Desk,Furniture,1,3057,0.20,UPI,Cancelled,5.0,3057,2445.6

In [101]:
# Apply()-row-wise

def discount_label(x):
    if x==0:
        return "Nodiscount"
    elif x<=0.10:
        return "Low Discount"
    else:
        return "High Discount"
df["DiscountCategory"]=df["DiscountPct"].apply(discount_label)

In [102]:
df.head()

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount,DiscountCategory
0,1001,2024-01-01,252,Pooja,Delhi,Laptop,Electronics,1,5852,0.10,UPI,Returned,5.0,5852,5266.8,Low Discount
1,1002,2024-01-01,293,Siddharth,Mumbai,Mobile,Electronics,1,27922,0.05,Cash,Delivered,5.0,27922,26525.9,Low Discount
2,1003,2024-01-01,215,Megha,Hyderabad,Mobile,Electronics,3,42376,0.15,Debit Card,Cancelled,5.0,127128,108058.8,High Discount
3,1004,2024-01-01,272,Ananya,Hyderabad,Monitor,Electronics,1,61492,0.20,UPI,Delivered,3.0,61492,49193.6,High Discount
4,1005,2024-01-02,261,Rohit,Chennai,Tablet,Electronics,1,18306,0.15,Cash,Cancelled,4.0,18306,15560.1,High Discount

In [103]:
# map()-maps the specified value to the given value

city_region={
    "Pune":"West",
    "Mumbai":"West",
    "Delhi":"North",
    "Banglore":"South",
    "Hyderabad":"South",
    "Chennai":"South"}
df["Region"]=df["City"].map(city_region)

In [104]:
df.head()

,OrderID,OrderDate,CustomerID,CustomerName,City,Product,Category,Quantity,UnitPrice,DiscountPct,PaymentMode,OrderStatus,Rating,TotalSale,ExactSalesAmount,DiscountCategory,Region
0,1001,2024-01-01,252,Pooja,Delhi,Laptop,Electronics,1,5852,0.10,UPI,Returned,5.0,5852,5266.8,Low Discount,North
1,1002,2024-01-01,293,Siddharth,Mumbai,Mobile,Electronics,1,27922,0.05,Cash,Delivered,5.0,27922,26525.9,Low Discount,West
2,1003,2024-01-01,215,Megha,Hyderabad,Mobile,Electronics,3,42376,0.15,Debit Card,Cancelled,5.0,127128,108058.8,High Discount,South
3,1004,2024-01-01,272,Ananya,Hyderabad,Monitor,Electronics,1,61492,0.20,UPI,Delivered,3.0,61492,49193.6,High Discount,South
4,1005,2024-01-02,261,Rohit,Chennai,Tablet,Electronics,1,18306,0.15,Cash,Cancelled,4.0,18306,15560.1,High Discount,South

In [105]:
df["City"].unique() # unique is used to get the unique value in the column.

array(['Delhi', 'Mumbai', 'Hyderabad', 'Chennai', 'Pune', 'Bangalore'],
      dtype=object)

In [106]:
df["City"].nunique()# nunique is used to get the number of uinque value in the column.

6

In [107]:
df["City"].value_counts() # value_count is used to get the total count for each unique value in the column.

City
Chennai      102
Pune          97
Delhi         95
Bangalore     93
Mumbai        82
Hyderabad     81
Name: count, dtype: int64

# ASSIGNMENT

# 1.Load the dataset into a Pandas DataFrame.

In [109]:
df=pd.read_csv("C:\\Users\\Neha\\Downloads\\edtech_student_learning_data.csv")

# 2.Display the first 10 records of the dataset.

In [110]:
df.head(10)

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.6,19,Placed,8,69.17,502210.0
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.2,26,Not Placed,8,98.33,NaN

# 3.Display the last 5 records of the dataset.

In [111]:
df.tail()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 4.Check the shape of the dataset.

# 5.Display all column names along with their data types.

In [112]:
df.dtypes

student_id             int64
student_name          object
gender                object
city                  object
enrollment_date       object
course                object
batch_type            object
total_sessions         int64
sessions_attended      int64
avg_quiz_score         int64
assignment_score       int64
project_score          int64
final_rating         float64
learning_hours         int64
placement_status      object
feedback_score         int64
attendance_pct       float64
salary_offered       float64
dtype: object

# 6.Generate summary statistics for all numerical columns.

In [158]:
df.describe()

,student_id,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,feedback_score,attendance_pct,salary_offered,total_score
count,505.000000,505.0,505.000000,505.000000,505.000000,505.000000,505.000000,505.000000,505.000000,505.000000,3.360000e+02,505.000000
mean,1251.015842,120.0,88.102970,69.601980,71.984158,75.287129,3.535220,22.128713,7.041584,73.419149,7.701324e+05,216.873267
std,144.242011,0.0,17.087232,17.137226,15.777337,14.678794,0.838068,9.924180,1.370122,14.239418,2.656396e+05,27.491264
min,1001.000000,120.0,60.000000,40.000000,45.000000,50.000000,2.000000,5.000000,5.000000,50.000000,3.005150e+05,140.000000
25%,1127.000000,120.0,73.000000,56.000000,58.000000,62.000000,2.800000,14.000000,6.000000,60.830000,5.442040e+05,198.000000
50%,1251.000000,120.0,88.000000,69.000000,72.000000,76.000000,3.535220,23.000000,7.000000,73.330000,7.788115e+05,217.000000
75%,1376.000000,120.0,103.000000,84.000000,86.000000,88.000000,4.200000,31.000000,8.000000,85.830000,1.003022e+06,235.000000
max,1500.000000,120.0,119.000000,99.000000,99.000000,99.000000,5.000000,39.000000,9.000000,99.170000,1.199092e+06,292.000000

# Interpretations

-StudentId
-studentid have **505** values.
-In studentid mean **1251.015842** is greater than std **144.242011** so ths data is strong and stable.
-In studentid **1001** is the minimum value and **1500** is the maximum value.
-studentid feature have 25% of data lies below this value **1127**.
-studentid have 50% of data lies below this value **1251**.
-studentid have 75% of data lies below this value **1376**.

-Total_Sessions
-totalsessions have **505** values.
-totalsessions mean **120** is greater than std **0** so this data is strong and stable.
-totalsessions **120** is the minimum value and **120** is the maximum value.
-totalsessions have 25% of data lies below this value **120**.
-totalsessions have 50% of data lies below this value **120**.
-totalsessions have 75% of data lies below this value **120**.

-Sessions_Attended
-sessionsattended have 505 values.
-sessionattended mean **88.102970** is greater than std **17.087232** so this data is strong and stable.
-sessionattended **60** is the minimum value and **119** is the maximum value.
-sessionattended have 25% of data lies below this value **73**.
-sessionattended have 50% of data lies below this value **88**.
-sessionattended have 75% of data lies below this value **103**.

-Avg_Quiz_Score
-avgquizscore have 505 values.
-avgquizscore feature have mean **69.601980** is greater than std **17.137226** so this data is strong and stable.
-avgquizscore **40** is the minimum value and **99** is the maximum value.
-avgquizscore have 25% of data lies below this value **56**.
-avgquizscore have 50% of data lies below this value **69**.
-avgquizscore have 75% of data lies below this value **84**.

-Assignment_Score
-assignmentscore have 505 values.
-assignmentscore feature have mean **71.984158** is greater than std **15.777337** so this data is strong and stable.
-assignmentscore **45** is the minimum value and **99** is the maximum value.
-assignmentscore have 25% of data lies below this value **58**.
-assignmentscore have 50% of data lies below this value **72**.
-assignmentscore have 75% of data lies below this value **86**.

-Project_Score
-projectscore have 505 values.
-projectscore feature have mean **75.287129** is greater than std **14.678794** so this data is strong and stable.
-projectscore **50** is the minimum value and **99** is the maximum value.
-projectscore have 25% of data lies below this value **62**.
-projectscore have 50% of data lies below this value **76**.
-projectscore have 75% of data lies below this value **88**.

-Final_Rating
-finalrating have 477 values.39 values are missing.
-finalrating feature have mean **3.535220** is greater than std **0.862365** so this data is strong and stable.
-finalrating **2** is the minimum value and **5** is the maximum value
-finalrating have 25% of data lies below this value **2.800000**.
-finalrating have 50% of data lies below this value **3.600000**.
-finalrating have 75% of data lies below this value **4.300000**.

-Learning_Hours
-learninghours have 505 values.
-learninghours feature have mean **22.128713** is greater than std **9.924180** so this data is strong and stable.
-learninghours **5** is the minimum value and **39** is the maximum value.
-learninghours have 25% of data lies below this value **12**.
-learninghours have 50% of data lies below this value **23**.
-learninghours have 75% of data lies below this value **31**.

-Feedback_Score
-feedbackscore have 505 values.
-feedbackscore feature have mean **7.041584** is greater than std **1.370122** so this data is strong and stable.
-feedbackscore **5** is the minimum value and **9** is the maximum value.
-feedbackscore have 25% of data lies below this value **6**.
-feedbackscore have 50% of data lies below this value **7**.
-feedbackscore have 75% of data lies below this value **8**.

-Attendance_Pct
-attendancepct have 505 values.
-attendancepct feature have mean **73.419149** is greater than std **14.239418* so this data is strong and stable.
-attendancepct **50** is the minimum value and **99** is the maximum value.
-attendancepct have 25% of data lies below this value **60.830000**.
-attendancepct have 50% of data lies below this value **73.330000**.
-attendancepct have 75% of data lies below this value **85.830000**.

-Salary_Offered
-salaryoffered have 3.360000e+05 values.
-salaryoffered feature have mean **7.701324e+05** is greater than std **2.656396e+05** so this data is strong and stable.
-salaryoffered **3.005150e+05** is the minimum value and **1.199092e+06**is the maximum value.
-salaryoffered have 25% of data lies below this value **5.442040e+05**.
-salaryoffered have 50% of data lies below this value **7.788115e+05**.
-salaryoffered have 75% of data lies below this value **1.1003022e+06**.

Total_Score
-totalscore have 505 values.
-totalscore feature have mean **216.873267** is greater than std **27.491264** so this data is strong and stable.
-totalscore **140** is the minimum value and **292** is the maximum value.
-totalscore have 25% of data lies below this value **198**.
-totalscore have 50% of data lies below this value **217**.
-totalscore have 75% of data lies below this value **235**.

# 7.Identify columns that contain missing values

In [114]:
df.isna().sum()

student_id             0
student_name           0
gender                 0
city                   0
enrollment_date        0
course                 0
batch_type             0
total_sessions         0
sessions_attended      0
avg_quiz_score         0
assignment_score       0
project_score          0
final_rating          28
learning_hours         0
placement_status       0
feedback_score         0
attendance_pct         0
salary_offered       169
dtype: int64

# 8.Count the number of missing values in each column.

In [115]:
df.isna().sum()

student_id             0
student_name           0
gender                 0
city                   0
enrollment_date        0
course                 0
batch_type             0
total_sessions         0
sessions_attended      0
avg_quiz_score         0
assignment_score       0
project_score          0
final_rating          28
learning_hours         0
placement_status       0
feedback_score         0
attendance_pct         0
salary_offered       169
dtype: int64

# 9.Calculate the percentage of missing values in the final_rating column.

# 10.Fill missing values in the final_rating column using the mean.

In [116]:
df["final_rating"].fillna(df["final_rating"].mean(), inplace=True)

C:\Users\Neha\AppData\Local\Temp\ipykernel_7872\4148491563.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["final_rating"].fillna(df["final_rating"].mean(), inplace=True)

# 11.Verify that missing values in final_string are handled.

# 12.Check whether duplicate records exist in the dataset.

In [117]:
df.duplicated().sum()

np.int64(5)

# 13.Count the total number of duplicate rows.

In [118]:
df.duplicated().sum()

np.int64(5)

# 14.Display all duplicate records.

In [119]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
500     True
501     True
502     True
503     True
504     True
Length: 505, dtype: bool

# 15.Remove duplicate records from the dataset.

# 16.Verify the dataset size after removing duplicates.

# 17.Find the number of unique values in the city column.

In [120]:
df["city"].nunique()

6

# 18.Find the number of unique values in the course column.

In [121]:
df["course"].nunique()

4

# 19.Display all unique cities present in the dataset.

In [122]:
df["city"].unique()

array(['Hyderabad', 'Pune', 'Delhi', 'Mumbai', 'Chennai', 'Bangalore'],
      dtype=object)

# 20.Count the number of students in each city.

In [123]:
df["city"].value_counts()

city
Hyderabad    100
Mumbai        95
Pune          87
Bangalore     82
Chennai       73
Delhi         68
Name: count, dtype: int64

# 21.Count the number of students enrolled in each course.

In [124]:
df["course"].value_counts()

course
Data Analytics    143
Data Science      128
AI & ML           126
Generative AI     108
Name: count, dtype: int64

# 22.Identify the course with the highest student enrollment.

# 23.Count the number of students who are placed and not placed.

In [125]:
df[df["placement_status"]=="Placed"].value_counts()

student_id  student_name  gender  city       enrollment_date  course          batch_type  total_sessions  sessions_attended  avg_quiz_score  assignment_score  project_score  final_rating  learning_hours  placement_status  feedback_score  attendance_pct  salary_offered
1210        Student_210   Male    Bangalore  2024-04-04       AI & ML         Weekday     120             75                 40              84                77             2.4           19              Placed            5               62.50           750043.0          2
1178        Student_178   Male    Delhi      2024-01-20       Generative AI   Weekday     120             80                 97              92                66             4.7           33              Placed            5               66.67           890611.0          2
1397        Student_397   Female  Mumbai     2024-05-27       Generative AI   Weekend     120             101                66              83                66             3.6           25              Placed            7               84.17           1003022.0         2
1007        Student_7     Male    Mumbai     2024-02-22       Data Analytics  Weekend     120             112                93              89                94             3.2           29              Placed            6               93.33           707137.0          1
1008        Student_8     Male    Chennai    2024-07-23       Data Science    Weekend     120             109                72              77                72             4.3           14              Placed            6               90.83           1053790.0         1
                                                                                                                                                                                                                                                                               ..
1045        Student_45    Female  Chennai    2024-02-03       Data Science    Weekend     120             106                99              70                87             2.4           27              Placed            7               88.33           431562.0          1
1047        Student_47    Female  Pune       2024-08-05       AI & ML         Weekday     120             106                71              49                71             4.6           37              Placed            6               88.33           961334.0          1
1048        Student_48    Male    Mumbai     2024-10-27       Data Analytics  Weekend     120             93                 68              73                74             3.7           9               Placed            6               77.50           942510.0          1
1050        Student_50    Female  Hyderabad  2024-10-08       Data Science    Weekend     120             114                41              64                66             4.8           15              Placed            6               95.00           908148.0          1
1005        Student_5     Male    Mumbai     2024-02-03       Generative AI   Weekday     120             101                41              55                50             2.1           23              Placed            9               84.17           970105.0          1
Name: count, Length: 333, dtype: int64

# 24.Filter students whose attendance percentage is greater than 80.

In [126]:
df[df["attendance_pct"]>80]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
475,1476,Student_476,Female,Chennai,2024-02-05,Data Analytics,Weekday,120,97,99,99,94,3.6,33,Placed,9,80.83,855839.0
477,1478,Student_478,Female,Mumbai,2024-07-06,AI & ML,Weekend,120,104,88,73,87,3.8,14,Placed,5,86.67,749813.0
481,1482,Student_482,Female,Mumbai,2024-07-15,Generative AI,Weekend,120,101,63,56,66,3.6,30,Placed,9,84.17,309637.0
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.3,26,Not Placed,7,92.50,NaN
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 25.Filter students who attended fewer than 70 sessions.

In [127]:
df[df["total_sessions"]>70]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 26.Filter students with an average quiz score above 85.

In [128]:
df[df["avg_quiz_score"]>85]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
14,1015,Student_15,Female,Delhi,2024-05-30,Data Analytics,Weekend,120,88,93,71,64,3.9,29,Placed,7,73.33,1128411.0
16,1017,Student_17,Female,Mumbai,2024-12-01,AI & ML,Weekend,120,98,91,50,68,3.4,5,Not Placed,9,81.67,NaN
23,1024,Student_24,Female,Hyderabad,2024-12-17,Data Science,Weekday,120,103,92,60,69,4.2,13,Not Placed,6,85.83,NaN
33,1034,Student_34,Female,Bangalore,2024-04-01,Generative AI,Weekend,120,114,99,98,52,4.3,32,Placed,6,95.00,572448.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.1,14,Placed,7,71.67,572544.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0
497,1498,Student_498,Female,Bangalore,2024-03-21,Data Analytics,Weekday,120,94,94,53,63,3.4,39,Placed,7,78.33,333896.0
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0

# 27.Filter students enrolled in the Data Science course.

In [129]:
df[df["course"]=="Data Science"]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.60000,8,Placed,5,60.83,501904.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.30000,14,Placed,6,90.83,1053790.0
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.60000,25,Not Placed,7,85.00,NaN
13,1014,Student_14,Male,Mumbai,2024-09-05,Data Science,Weekday,120,109,55,91,96,3.70000,34,Placed,6,90.83,645430.0
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.90000,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
487,1488,Student_488,Female,Pune,2024-09-17,Data Science,Weekday,120,66,92,65,51,2.20000,27,Placed,7,55.00,797760.0
489,1490,Student_490,Male,Pune,2024-09-12,Data Science,Weekend,120,73,75,92,62,4.10000,6,Placed,7,60.83,667747.0
490,1491,Student_491,Female,Bangalore,2024-08-09,Data Science,Weekday,120,68,58,64,96,3.40000,35,Placed,6,56.67,1097955.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.10000,14,Placed,7,71.67,572544.0
498,1499,Student_499,Male,Mumbai,2024-07-20,Data Science,Weekday,120,77,72,48,76,3.53522,27,Placed,8,64.17,778646.0

# 28.Filter students who are not placed and attended more than 75 sessions.

In [130]:
df[(df["placement_status"]=="Not Placed") & (df["sessions_attended"]>75)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.2,26,Not Placed,8,98.33,NaN
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.6,25,Not Placed,7,85.00,NaN
15,1016,Student_16,Male,Mumbai,2024-07-01,Data Analytics,Weekday,120,116,85,59,90,3.6,32,Not Placed,7,96.67,NaN
16,1017,Student_17,Female,Mumbai,2024-12-01,AI & ML,Weekend,120,98,91,50,68,3.4,5,Not Placed,9,81.67,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
469,1470,Student_470,Female,Hyderabad,2024-09-19,Generative AI,Weekday,120,111,73,52,52,3.6,24,Not Placed,6,92.50,NaN
473,1474,Student_474,Female,Delhi,2024-05-26,Data Analytics,Weekend,120,108,70,66,81,3.7,15,Not Placed,6,90.00,NaN
480,1481,Student_481,Female,Mumbai,2024-10-29,Data Science,Weekday,120,83,61,74,89,3.9,36,Not Placed,7,69.17,NaN
488,1489,Student_489,Male,Chennai,2024-10-19,Generative AI,Weekend,120,111,70,49,75,3.3,26,Not Placed,7,92.50,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN

# 29.Filter students belonging to Pune,Banglore,or Hyderabad.

In [131]:
df[df["city"].isin(["Pune", "Banglore","Hyderabad"])]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.9,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.1,9,Placed,8,50.83,867354.0
495,1496,Student_496,Male,Hyderabad,2024-12-29,Data Science,Weekday,120,86,94,97,57,3.1,14,Placed,7,71.67,572544.0
496,1497,Student_497,Male,Hyderabad,2024-10-06,Generative AI,Weekday,120,61,88,53,72,3.7,28,Placed,5,50.83,834633.0
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN

# 30.Filter students enrolled in Ai & Ml or Generative AI courses.

In [132]:
df[df["course"].isin(["AI & ML", "Generative AI"])]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.6,30,Placed,6,65.83,305730.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
503,1178,Student_178,Male,Delhi,2024-01-20,Generative AI,Weekday,120,80,97,92,66,4.7,33,Placed,5,66.67,890611.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 31. Filter students whose average quiz score lies between 60 and 80.

In [133]:
df[df["avg_quiz_score"].between(60,80)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.70000,5,Not Placed,8,59.17,NaN
5,1006,Student_6,Female,Pune,2024-09-18,Generative AI,Weekend,120,79,64,98,57,2.60000,30,Placed,6,65.83,305730.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.30000,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.60000,19,Placed,8,69.17,502210.0
9,1010,Student_10,Female,Delhi,2024-08-22,Data Analytics,Weekday,120,118,70,50,89,4.20000,26,Not Placed,8,98.33,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
489,1490,Student_490,Male,Pune,2024-09-12,Data Science,Weekend,120,73,75,92,62,4.10000,6,Placed,7,60.83,667747.0
493,1494,Student_494,Female,Delhi,2024-12-20,Generative AI,Weekday,120,94,75,88,88,3.90000,36,Placed,8,78.33,596618.0
494,1495,Student_495,Male,Pune,2024-12-07,AI & ML,Weekend,120,61,69,77,52,4.10000,9,Placed,8,50.83,867354.0
498,1499,Student_499,Male,Mumbai,2024-07-20,Data Science,Weekday,120,77,72,48,76,3.53522,27,Placed,8,64.17,778646.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.60000,25,Placed,7,84.17,1003022.0

# 32.Filter students whose assignment score lies between 70 and 90.

In [134]:
df[df["assignment_score"].between(70,90)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0
6,1007,Student_7,Male,Mumbai,2024-02-22,Data Analytics,Weekend,120,112,93,89,94,3.2,29,Placed,6,93.33,707137.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
14,1015,Student_15,Female,Delhi,2024-05-30,Data Analytics,Weekend,120,88,93,71,64,3.9,29,Placed,7,73.33,1128411.0
20,1021,Student_21,Female,Pune,2024-07-02,AI & ML,Weekday,120,102,45,83,89,3.7,23,Not Placed,6,85.00,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 33.Filter students whose learing hours lie between 10 and 25.

In [135]:
df[df["learning_hours"].between(10,25)]

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0
7,1008,Student_8,Male,Chennai,2024-07-23,Data Science,Weekend,120,109,72,77,72,4.3,14,Placed,6,90.83,1053790.0
8,1009,Student_9,Male,Mumbai,2024-05-05,AI & ML,Weekend,120,83,75,61,96,2.6,19,Placed,8,69.17,502210.0
10,1011,Student_11,Male,Chennai,2024-02-12,Data Science,Weekday,120,102,53,48,61,4.6,25,Not Placed,7,85.00,NaN
18,1019,Student_19,Female,Pune,2024-01-08,Data Science,Weekend,120,115,74,58,78,2.9,11,Placed,8,95.83,1000399.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
499,1500,Student_500,Female,Pune,2024-06-06,AI & ML,Weekday,120,73,57,79,78,3.8,21,Placed,7,60.83,1115331.0
500,1452,Student_452,Female,Mumbai,2024-03-07,Generative AI,Weekday,120,68,84,84,58,2.2,19,Not Placed,8,56.67,NaN
501,1276,Student_276,Female,Hyderabad,2024-10-15,Generative AI,Weekday,120,95,92,81,91,3.2,16,Not Placed,8,79.17,NaN
502,1210,Student_210,Male,Bangalore,2024-04-04,AI & ML,Weekday,120,75,40,84,77,2.4,19,Placed,5,62.50,750043.0
504,1397,Student_397,Female,Mumbai,2024-05-27,Generative AI,Weekend,120,101,66,83,66,3.6,25,Placed,7,84.17,1003022.0

# 34.Create a new column total_score as the sum of quiz ,assignment,and project scores.

In [136]:
df["total_score"]=df["avg_quiz_score"]+df["assignment_score"]+df["project_score"]
print(df["total_score"])

0      221
1      233
2      194
3      236
4      146
      ...
500    226
501    264
502    201
503    255
504    215
Name: total_score, Length: 505, dtype: int64

In [137]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0,221
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN,233
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0,194
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN,236
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0,146

# 35.Create a new column attendance_flag based on attendance percentage.

In [138]:
def percentage(x):
    if x>75:
        return "Good"
    else:
        return "Not Good"
df["attendance_flag"]=df["attendance_pct"].apply(percentage)

In [139]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,assignment_score,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,96,66,3.7,6,Placed,7,90.00,738963.0,221,Good
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,93,83,4.5,33,Not Placed,8,91.67,NaN,233,Good
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,72,73,3.6,8,Placed,5,60.83,501904.0,194,Not Good
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,91,81,2.7,5,Not Placed,8,59.17,NaN,236,Not Good
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,55,50,2.1,23,Placed,9,84.17,970105.0,146,Good

# 36.Create a new column learning_intensity based on learing hours.

In [140]:
def learning_label(x):
    if x>20:
        return "High"
    elif x>=10:
        return "Medium"
    else:
        return "Low"
df["learning_intensity"]=df["learning_hours"].apply(learning_label)

In [141]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,project_score,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,66,3.7,6,Placed,7,90.00,738963.0,221,Good,Low
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,83,4.5,33,Not Placed,8,91.67,NaN,233,Good,High
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,73,3.6,8,Placed,5,60.83,501904.0,194,Not Good,Low
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,81,2.7,5,Not Placed,8,59.17,NaN,236,Not Good,Low
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,50,2.1,23,Placed,9,84.17,970105.0,146,Good,High

# 37.Classify students based on total_score using apply().

In [142]:
def classify(x):
    if x >= 150:
        return 'First Class'
    elif x >= 100:
        return 'Pass'
    else:
        return 'Fail'
df["result"]=df["total_score"].apply(classify)

In [143]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,final_rating,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,result
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,3.7,6,Placed,7,90.00,738963.0,221,Good,Low,First Class
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,4.5,33,Not Placed,8,91.67,NaN,233,Good,High,First Class
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,3.6,8,Placed,5,60.83,501904.0,194,Not Good,Low,First Class
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,2.7,5,Not Placed,8,59.17,NaN,236,Not Good,Low,First Class
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,2.1,23,Placed,9,84.17,970105.0,146,Good,High,Pass

# 38.Create a placement eligibility column using apply().

In [144]:
def placement_eligibility(x):
    if x >= 150:
        return 'Eligible'
    else:
        return 'Not Eligible'
df["placement_eligibility"]=df["total_score"].apply(placement_eligibility)

In [145]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,learning_hours,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,result,placement_eligibility
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,6,Placed,7,90.00,738963.0,221,Good,Low,First Class,Eligible
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,33,Not Placed,8,91.67,NaN,233,Good,High,First Class,Eligible
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,8,Placed,5,60.83,501904.0,194,Not Good,Low,First Class,Eligible
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,5,Not Placed,8,59.17,NaN,236,Not Good,Low,First Class,Eligible
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,23,Placed,9,84.17,970105.0,146,Good,High,Pass,Not Eligible

# 39.Map placement_status values to numerical values.

In [146]:
numerical_values={
    "Placed":"01",
    "Not Placed":"02"
}
df["numerical"]=df["placement_status"].map(numerical_values)

In [147]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,placement_status,feedback_score,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,result,placement_eligibility,numerical
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,Placed,7,90.00,738963.0,221,Good,Low,First Class,Eligible,01
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,Not Placed,8,91.67,NaN,233,Good,High,First Class,Eligible,02
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,Placed,5,60.83,501904.0,194,Not Good,Low,First Class,Eligible,01
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,Not Placed,8,59.17,NaN,236,Not Good,Low,First Class,Eligible,02
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,Placed,9,84.17,970105.0,146,Good,High,Pass,Not Eligible,01

# 40.Map batch_type values to abbreviated codes.

In [155]:
abbreviated_codes={
    "Weekday":"day",
    "Weekend":"end"
}
df["abbreviated"]=df["batch_type"].map(abbreviated_codes)

In [156]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,result,placement_eligibility,numerical,abbreviated,gender_values
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,90.00,738963.0,221,Good,Low,First Class,Eligible,01,day,M
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,91.67,NaN,233,Good,High,First Class,Eligible,02,day,F
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,60.83,501904.0,194,Not Good,Low,First Class,Eligible,01,day,M
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,59.17,NaN,236,Not Good,Low,First Class,Eligible,02,end,M
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,84.17,970105.0,146,Good,High,Pass,Not Eligible,01,day,M

# 41.Map gender values to single letter codes.

In [150]:
letter_codes={
    "Male":"M",
    "Female":"F"
}
df["gender_values"]=df["gender"].map(letter_codes)

In [151]:
df.head()

,student_id,student_name,gender,city,enrollment_date,course,batch_type,total_sessions,sessions_attended,avg_quiz_score,...,attendance_pct,salary_offered,total_score,attendance_flag,learning_intensity,result,placement_eligibility,numerical,abbreviated,gender_values
0,1001,Student_1,Male,Hyderabad,2024-11-25,Generative AI,Weekday,120,108,59,...,90.00,738963.0,221,Good,Low,First Class,Eligible,01,,M
1,1002,Student_2,Female,Hyderabad,2024-09-29,AI & ML,Weekday,120,110,57,...,91.67,NaN,233,Good,High,First Class,Eligible,02,,F
2,1003,Student_3,Male,Pune,2024-12-05,Data Science,Weekday,120,73,49,...,60.83,501904.0,194,Not Good,Low,First Class,Eligible,01,,M
3,1004,Student_4,Male,Delhi,2024-03-09,AI & ML,Weekend,120,71,64,...,59.17,NaN,236,Not Good,Low,First Class,Eligible,02,,M
4,1005,Student_5,Male,Mumbai,2024-02-03,Generative AI,Weekday,120,101,41,...,84.17,970105.0,146,Good,High,Pass,Not Eligible,01,,M

# 42.Count students under each learning_intensity category.

In [152]:
df["learning_intensity"].value_counts()

learning_intensity
High      281
Medium    152
Low        72
Name: count, dtype: int64

# 43.Calculate the percentage of placement-eligible students.

# 44.Identify the city with the highest number of placed students.

In [162]:
df["city"]=="Placed"

0      False
1      False
2      False
3      False
4      False
       ...
500    False
501    False
502    False
503    False
504    False
Name: city, Length: 505, dtype: bool

# 45.Compare average total_score for placed and not placed students.

# 46.Identify the top 5 students on total_score.

In [154]:
df["total_score"].head()

0    221
1    233
2    194
3    236
4    146
Name: total_score, dtype: int64